//IDMSCHEM EXEC PGM=IDMSCHEM
//SYSCTL DD DSN=IDMS-SYSCTL-filename,DISP=SHR
//SYSUDUMP DD SYSOUT=R
//SYSLST DD SYSOUT=R
//SYSPCH DD SYSOUT=R
//SYSIPT DD *
SIGNON … DICTNAME IS IDMS-DatabaseName
PUNCH SCHEMA NAME IS Schemaname VERSION HIGH
WITH AREAS
ALSO WITH RECORDS
ALSO WITH ELEMENTS
ALSO WITH DETAILS
ALSO WITH SETS